Основные_объекты_КР/src/Documents/ФормированиеБригады/ФормированиеБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеБригады</name>
  <registerRecords>InformationRegister.СформированныеБригады</registerRecords>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительДопущенВрачомКРейсам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БригадаПрошлаИнструктажПоТБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеЗначениеСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Основные_объекты_КР/src/InformationRegisters/СформированныеБригады/СформированныеБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СформированныеБригады</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ПервыйГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ВторойГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>НачальноеЗначениеСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_КР/src/Documents/ФормированиеБригады/Forms/ФормаДокументаУправляемая/Module.bsl
&НаКлиенте
Процедура ПроверитьКорректностьВыбораГрузчиков(ИзмененныйГрузчик)
	
	Если Объект.ПервыйГрузчик.Пустая() ИЛИ Объект.ВторойГрузчик.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПервыйГрузчик = Объект.ВторойГрузчик Тогда
		
		ПоказатьПредупреждение(
		Новый ОписаниеОповещения("ПроверитьКорректностьВыбораГрузчиковЗавершение", ЭтотОбъект),
		"Первый и второй грузчики должны быть разными сотрудниками.", 10, "Внимание!");

		Возврат;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьВыбораГрузчиковЗавершение(ДополнительныеПараметры) Экспорт
	
	ИзмененныйГрузчик = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");

КонецПроцедуры

&НаКлиенте
Процедура ПервыйГрузчикПриИзменении(Элемент)
	
	ПроверитьКорректностьВыбораГрузчиков(Объект.ПервыйГрузчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ВторойГрузчикПриИзменении(Элемент)
	
	ПроверитьКорректностьВыбораГрузчиков(Объект.ВторойГрузчик);
	
КонецПроцедуры

&НаСервере
Процедура МашинаПриИзмененииНаСервере(Машина, НачальноеЗначениеСчетчика, Период = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СформированныеБригадыСрезПоследних.НачальноеЗначениеСчетчика
		|ИЗ
		|	РегистрСведений.СформированныеБригады.СрезПоследних(&Период, Машина = &Машина) КАК СформированныеБригадыСрезПоследних";
	
	Запрос.УстановитьПараметр("Машина", Машина);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НачальноеЗначениеСчетчика = ВыборкаДетальныеЗаписи.НачальноеЗначениеСчетчика;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МашинаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
	
		МашинаПриИзмененииНаСервере(Объект.Машина, Объект.НачальноеЗначениеСчетчика);
	
	КонецЕсли;
	
КонецПроцедуры
